seventyfivehard-backend/app/controllers/api/v1/attempts_controller.rb

    def create

        @attempt = Attempt.new(attempt_params)
        if @attempt.save
---
INSERT INTO "attempts" ("completed", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["completed", 0], ["user_id", 1], ["created_at", "2020-06-22 10:33:16.901397"], ["updated_at", "2020-06-22 10:33:16.901397"]]

    def show
        @attempt = Attempt.find(params[:id])
---
SELECT "attempts".* FROM "attempts" WHERE "attempts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]