seventyfivehard-backend/app/controllers/api/v1/days_controller.rb

INSERT INTO "days" ("diet", "workout_one", "workout_two", "no_alcohol", "no_cheatmeal", "progress_pic", "drank_water", "book_read", "attempt_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @day = Day.new(day_params)
        if @day.save

SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @day = Day.find(params[:id])

SELECT "attempts".* FROM "attempts" WHERE "attempts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_attempt
        @attempt = Attempt.find(params[:attempt_id])