seventyfivehard-backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "username", "goals", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mishka"], ["username", "mishka"], ["goals", "To zoom faster"], ["created_at", "2020-06-23 10:26:56.963058"], ["updated_at", "2020-06-23 10:26:56.963058"]]
---
    def create

        @user = User.new(user_params)
        if @user.save